In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}

In [3]:
data1=pd.DataFrame(dict1)

In [4]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [5]:
data1.isnull().sum()
# every column has one missing value is there

Names    1
Age      1
City     1
dtype: int64

In [6]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [7]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [8]:
# we create one more way

In [9]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [10]:
data2.isnull()  # none is categorical

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [11]:
# one more way

In [12]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','Chennai']}              # the name its self Null
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

**Methoud-1**
 
>Fill  the missing values with random number


dataframe =data1

methoud name.fillna

In [13]:
data1.fillna(50)  # all the data fillwith randomly given

    Names   Age     City
0  Ramesh  31.0       50
1  Suresh  32.0      Hyd
2      50  33.0   Mumbai
3  Mahesh  50.0  Chennai

In [14]:
**Methoud-2**

>fill the missing values with

SyntaxError: invalid syntax (1093573895.py, line 1)

In [15]:
data1['Names'].fillna('Sathish',inplace=true)
data1

NameError: name 'true' is not defined

In [ ]:
# create  the data again

dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)
data1

**Methoud-3**

- bfill
- ffill
- pad
- backfill

In [ ]:
data1.fillna(method='backfill')
# Name index 2 is missed value
#      it will replace by index 3 value
# Age index 3 is missed value
#     we dont have index 4, so the value is NaN
# city index 0 has missed value
#      it replace with index 1 value

In [16]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [17]:
data1.bfill()

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [18]:
data1.ffill()

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

- bfill and backfill both are same

- pad and ffill both are same

**Methoud-4**

- Mean
- edian
- Mode

In [19]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [20]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [21]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [22]:
# instead of providing random number
# we are filling with mean of the data

In [23]:
age_median=data1['Age'].median()
age_median

32.0

In [24]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [25]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [26]:
# level1: Meam,Median,Mode
# Level2: bfill,
# Level3: KNN imputer

**Methoud-5**

#### KNN imputer

KNN: K  Nearest Neighbours
    
- in the imputer instead of taking mean of all the values
- will choose neighbours data
- will take those mean only
#only fpr numerical  data not categorical

**KNN Imputer**

- n_neighbore is parameter can choose by user     # vv imp

- if we dont choos by deafault it will takes as=5

In [29]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [30]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

**Methoud-6**

- based on otjher columns
    
- some times all above methouds will not provide good justification

- At that time we need to check other columns dependancy also

- Most of the time will pick a column which have heighest correlation